<?php
// +----------------------------------------------------------------------
// | FileName:   config.php
// +----------------------------------------------------------------------
// | Dscription:   前台配置文件
// +----------------------------------------------------------------------
// | Date:  2017/7/31 13:32
// +----------------------------------------------------------------------
// | Author: showkw <showkw@163.com>
// +----------------------------------------------------------------------

/**
 * 前台配置文件
 * 所有除开系统级别的前台配置
 */
return array(
	/* 主题设置 */
	//'DEFAULT_THEME' =>  'default',  // 默认模板主题名称
	'HOME_LOGIN_PWD_CHECK'  =>[
		'type' => 0, //验证模式: 默认为0 验证格式为 小写字母加数字, 1 验证格式为 大写加小写加数字
		'min'  => 3, //最少长度
		'max'  => 20, //最大长度
	],
	'DEFAULT_CONTROLLER'    =>  'Default', // 默认控制器名称
	'HOME_LOGIN_FALSE_CHECK'    => 1, //是否开启登录错误次数限制,默认1为开启,0为关闭
	'HOME_LOGIN_FALSE_MAX'  => 5, //登录最大错误次数 默认为5次
	'HOME_LOGIN_FALSE_TIME' => 900, //登录超过错误次数限制时,账号冻结时间,单位为秒,默认900秒=15分钟
  	'depart_id'=>32,//出纳部门ID

);