<?php

// +----------------------------------------------------------------------
// | FileName:   LoginEvent.class.php
// +----------------------------------------------------------------------
// | Dscription:
// +----------------------------------------------------------------------
// | Date:  2018/05/18 22:16
// +----------------------------------------------------------------------
// | Author: kelly  <466395102@qq.com>
// +----------------------------------------------------------------------

namespace Home\Design;


interface SearchDesign
{

    //保存搜索条件
    function saveSearch();

    //使用搜索条件
    function indexSearch();

    //绶存的key
    function createKey3();

    function createKey2();

}